; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 433864 2 3 2 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	infrared0 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 infrared0)
	(have_image Planet8 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 4
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 4
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
4. (turn_to satellite1 groundstation4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 4
5. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 4
6. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 1 of 4
7. (turn_to satellite0 star7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star7)
   goals met: 0 of 4
8. (turn_to satellite1 planet8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet8)
   goals met: 0 of 4
9. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 1 of 4
10. (take_image satellite1 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 2 of 4
11. (turn_to satellite0 groundstation5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 4
12. (turn_to satellite1 phenomenon6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 4
13. (take_image satellite1 phenomenon6 instrument3 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 4 of 4
